# Pandas Exercises

Assigments for Pandas skills

** Import pandas and read in the banklist.csv file into a dataframe called banks. **

In [1]:
import pandas as pd

In [2]:
banks = pd.read_csv('banklist.csv')

** Show the head of the dataframe **

In [3]:
# CODE HERE
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

** What are the column names? **

In [4]:
# CODE HERE
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

** How many States (ST) are represented in this data set? **

In [5]:
# CODE HERE
state_values = banks.ST.unique() ######## returns a set of all unique strings in the column
print(len(state_values))

44

44

** Get a list or array of all the states in the data set. **

In [6]:
# CODE HERE
import numpy as np
np.array(banks.ST.unique())

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'], dtype=object)

** What are the top 5 states with the most failed banks? **

In [7]:
# CODE HERE
banks['ST'].value_counts(sort = True)[0:5]

GA    93
FL    75
IL    67
CA    41
MN    23
Name: ST, dtype: int64

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: Bank Name, dtype: int64

** What are the top 5 acquiring institutions? **

In [8]:
# CODE HERE
banks['Acquiring Institution'].value_counts(sort = True)[0:5]

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

** How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?**

In [22]:
# CODE HERE
number_acquired_banks = banks['Acquiring Institution'].value_counts()['State Bank of Texas']
print('Number of banks acquired by State Bank of Texas : ',number_acquired_banks)

acquired_banks = banks[banks['Acquiring Institution']=='State Bank of Texas']
banks_in_texas = acquired_banks['ST'].value_counts()['TX']
print('Number of acquired banks in Texas : ',banks_in_texas)

Number of banks acquired by State Bank of Texas :  3
Number of acquired banks in Texas :  1

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

** What is the most common city in California for a bank to fail in?**

In [27]:
# CODE HERE
failed_banks_california = banks[banks['ST'] == 'CA']

city_max_failed = failed_banks_california['City'].value_counts(sort = True)
print('City with the most failed banks in California : ', city_max_failed.index.values[0])

City with the most failed banks in California :  Los Angeles

,Bank Name,ST,CERT,Acquiring Institution,Closing Date,Updated Date
City,,,,,,
Los Angeles,4,4,4,4,4,4

** How many failed banks don't have the word "Bank" in their name? **

In [23]:
# CODE HERE
print(banks['Bank Name'].str.contains('Bank').value_counts()[False])

14

14

** How many bank names start with the letter 's' ? **

In [28]:
# CODE HERE
######### Here we consider Capital letter S alone since the dataset starts all the names with capitals else 
######### we can just add it with another check with lowecase 's'
print(banks['Bank Name'].str.startswith('S').value_counts()[True])

53

53

** How many CERT values are above 20000 ? **

In [30]:
# CODE HERE
print(banks[banks['CERT'] > 2e4].shape[0])

417

417

** How many bank names consist of just two words? (e.g. "First Bank" , "Bank Georgia" )**

In [38]:
# CODE HERE
def check_len(x) : 
    if len(x.split()) == 2 :
        return 1
    return 0

banks_names = banks['Bank Name']
nums = banks_names.apply(check_len)
nums.sum()

114

114

**Bonus: How many banks closed in the year 2008? (this is hard because we technically haven't learned about time series with pandas yet! Feel free to skip this one!**

In [41]:
# CODE HERE
def check_closing(x) :
    if x.split('-')[-1] == '08' :
        return True
    return False
banks_closing_date = banks['Closing Date']
banks_num_close = banks_closing_date.apply(check_closing).value_counts()[True]
print(banks_num_close)

25

25